## START

### EXPLORATORY DATA ANALYSIS 
- When ypu are visualizing the data you must have a clean data and this is where EDA comes in 
- We use all the libraries like numpy pandas matplotlib and seaborn to complete the EDA
- in EDA we deal with missing invalid and duplicate values as well

### IMPORTING LIBRARIES TO DO EDA

In [1]:
import numpy as np 
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

IMPORTING THE DATA SET

In [3]:
df=pd.read_csv(r"D:\data-analytics-porfolio\data-analytics-portfolio\datasets_for_analysis\Hr analytics dataset\hr_analytics_dataset.csv")
df.head()

,employee_id,age,gender,department,job_role,education_level,hire_year,experience_years,salary,performance_rating,attrition,marital_status,overtime,work_life_balance,satisfaction_score
0,1001,50,Female,IT,Analyst,High School,2020,10,201048,1,No,Married,No,Poor,2
1,1002,36,Female,R&D,Executive,High School,2010,12,199668,3,No,Single,Yes,Good,10
2,1003,29,Female,Sales,Executive,Bachelors,2012,16,179243,1,No,Divorced,Yes,Excellent,1
3,1004,42,Male,IT,Lead,PhD,2022,7,111365,3,No,Married,Yes,Average,2
4,1005,40,Male,Sales,Specialist,PhD,2016,20,139014,5,No,Single,Yes,Excellent,5

GETTING MORE INFO ON DATA SET

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 15 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   employee_id         300 non-null    int64
 1   age                 300 non-null    int64
 2   gender              300 non-null    object
 3   department          300 non-null    object
 4   job_role            300 non-null    object
 5   education_level     300 non-null    object
 6   hire_year           300 non-null    int64
 7   experience_years    300 non-null    int64
 8   salary              300 non-null    int64
 9   performance_rating  300 non-null    int64
 10  attrition           300 non-null    object
 11  marital_status      300 non-null    object
 12  overtime            300 non-null    object
 13  work_life_balance   300 non-null    object
 14  satisfaction_score  300 non-null    int64
dtypes: int64(7), object(8)
memory usage: 35.3+ KB

CHECKING THE SHAPE OF DATA SET - to know how many rows and columns are there

In [5]:
df.shape

(300, 15)

CHECKING FOR COUNT VALUES FOR THE CATEGORICAL COLUMNS

In [6]:
df['department'].value_counts()

department
Sales         56
Operations    54
HR            53
R&D           49
Finance       45
IT            43
Name: count, dtype: int64

In [7]:
df.head()

,employee_id,age,gender,department,job_role,education_level,hire_year,experience_years,salary,performance_rating,attrition,marital_status,overtime,work_life_balance,satisfaction_score
0,1001,50,Female,IT,Analyst,High School,2020,10,201048,1,No,Married,No,Poor,2
1,1002,36,Female,R&D,Executive,High School,2010,12,199668,3,No,Single,Yes,Good,10
2,1003,29,Female,Sales,Executive,Bachelors,2012,16,179243,1,No,Divorced,Yes,Excellent,1
3,1004,42,Male,IT,Lead,PhD,2022,7,111365,3,No,Married,Yes,Average,2
4,1005,40,Male,Sales,Specialist,PhD,2016,20,139014,5,No,Single,Yes,Excellent,5

In [8]:
df['job_role'].value_counts()

job_role
Specialist    61
Executive     53
Manager       53
Lead          49
Engineer      46
Analyst       38
Name: count, dtype: int64

In [10]:
df['education_level'].value_counts()

education_level
High School    78
Bachelors      78
Masters        78
PhD            66
Name: count, dtype: int64

In [ ]:
df['marital_status'].value_counts()

marital_status
Single      113
Divorced     99
Married      88
Name: count, dtype: int64

In [12]:
df['performance_rating'].value_counts()

performance_rating
4    69
5    68
1    56
2    55
3    52
Name: count, dtype: int64

CHECKING FOR NULL VALUES isna checked for null values for all columns in the dataframe as the csv file will be converted into dataframe automatically when its loaed

In [13]:
df.isna().sum()

employee_id           0
age                   0
gender                0
department            0
job_role              0
education_level       0
hire_year             0
experience_years      0
salary                0
performance_rating    0
attrition             0
marital_status        0
overtime              0
work_life_balance     0
satisfaction_score    0
dtype: int64